package com.ueueo.datagenerator.people;

import com.ueueo.datagenerator.core.base.Generator;
import com.ueueo.datagenerator.core.base.AbstractGeneratorWrapper;
import com.ueueo.datagenerator.core.RandomSequenceArrayGenerator;

/**
 * 中文名字生成器
 *
 * @author Lee
 * @date 2019-04-20 14:35
 */
public class ChineseNameGenerator extends AbstractGeneratorWrapper<String> implements Generator<String> {

    private static final String[] names = new String[]{"彭万里", "高大山", "谢大海", "马宏宇", "林莽",
            "黄强辉", "章汉夫", "范长江", "林君雄", "谭平山", "朱希亮", "李四光", "甘铁生", "张伍绍",
            "马继祖", "程孝先", "宗敬先", "年广嗣", "汤绍箕", "吕显祖", "何光宗", "孙念祖", "马建国",
            "节振国", "冯兴国", "郝爱民", "于学忠", "马连良", "胡宝善", "李宗仁", "洪学智", "余克勤",
            "吴克俭", "杨惟义", "李文信", "王德茂", "李书诚", "杨勇", "高尚德", "刁富贵", "汤念祖",
            "吕奉先", "何光宗", "冷德友", "安怡孙", "贾德善", "蔡德霖", "关仁", "郑义", "贾怡",
            "孙天民", "赵大华", "赵进喜", "赵德荣", "赵德茂", "钱汉祥", "钱运高", "钱生禄", "孙寿康",
            "孙应吉", "孙顺达", "李秉贵", "李厚福", "李开富", "王子久", "刘永生", "刘宝瑞", "关玉和",
            "王仁兴", "李际泰", "罗元发", "刘造时", "刘乃超", "刘长胜", "张成基", "张国柱", "张志远",
            "张广才", "吕德榜", "吕文达", "吴家栋", "吴国梁", "吴立功", "李大江", "张石山", "王海",
            "丁一茜", "丁云连", "丁亚林", "丁文庆", "丁爱兵", "丁秀平", "丁菲桐", "丁超", "丁远波",
            "丁金凤", "丁钰", "丁铭", "丁龙", "万仁清", "万军", "万国华", "万志成", "万斌", "万莉娜",
            "万超", "严家红", "严慧", "严水根", "严章云", "中昊翔", "丰斌斌", "丰畅", "乔蕾", "乔鹏",
            "于东佳", "于凯", "于国荣", "于守春", "于少飞", "于常建", "于振", "于晓爽", "于水清", "于法孟",
            "于海峰", "于海龙", "于清美", "于科富", "于荣华", "于迪", "于黎明", "井德泉", "仇建伟", "付兴兵",
            "付剑亮", "付子俊", "付小平", "付希亮", "付志冰", "付志刚", "付文青", "付桂芹", "付爱英",
            "付英雨", "付长禄", "付雷", "仝泽坤", "代善琴", "代安武", "代岩", "任义", "任利军", "任宁",
            "任庆展", "任建仲", "任建仲", "任志鹏", "任文辉", "任晖", "任永琴", "任海伦", "任玉林",
            "任金平", "何世学", "何丽娟", "何亮", "何修", "何兴统", "何坤德", "何大顺", "何小东", "何彦奇",
            "何志强", "何文才", "何朋飞", "何江琴", "何洪超", "何淑萍", "何玲晶", "何祝凤", "何西迎",
            "何超", "何辉文", "何金国", "余婷婷", "余强勇", "余永久", "余江", "余爱菊", "佟丽颖", "佟庆",
            "侯伟", "侯先涛", "侯冬梅", "侯峰祥", "侯广义", "侯开国", "侯彦霞", "侯文波", "侯海云", "侯清华",
            "侯秀珍", "侯秀芳", "侯超", "侯飞", "侯高辉", "俄广红", "俞红云", "候召芬", "候学荣", "倪凤英",
            "倪桂秀", "倪武田", "倪红", "傅健", "僧立永", "兰久会", "兰刚", "兰士茹", "兰燕", "兰越超",
            "关志兴", "关成英", "关鹏", "冉建红", "冯丽丽", "冯俊锋", "冯元星", "冯兆勤", "冯帅", "冯庆平",
            "冯强", "冯彭城", "冯志强", "冯春", "冯春叶", "冯景清", "冯桂镇", "冯贞亮", "冯长军", "冼斌",
            "凌全振", "凡林英", "刁飞", "刑彩琴", "刘青", "刘一忠", "刘丹丹", "刘丽", "刘乐", "刘二香",
            "刘亚丽", "刘伊宏", "刘伟", "刘俊", "刘俊芳", "刘健", "刘允升", "刘元祯", "刘元超", "刘光平",
            "刘光涛", "刘关林", "刘兴天", "刘兴芳", "刘军", "刘冠伟", "刘剑峰", "刘劲武", "刘华", "刘华东",
            "刘华平", "刘同景", "刘国", "刘国利", "刘国君", "刘大伟", "刘学伟", "刘宝瑞", "刘小杰", "刘小永",
            "刘居峰", "刘岩", "刘庆林", "刘建", "刘建会", "刘建宁", "刘建康", "刘志永", "刘志龙", "刘成杨",
            "刘战飞", "刘振海", "刘捕林", "刘提伟", "刘敏", "刘文军", "刘文松", "刘文鑫", "刘斌", "刘新磊",
            "刘旭", "刘昌海", "刘明冬", "刘昕", "刘星宇", "刘星辉", "刘春华", "刘春菊", "刘晓丹", "刘晓光",
            "刘晓峰", "刘晓敏", "刘景云", "刘杰", "刘根来", "刘永庆", "刘泽顺", "刘洪坡", "刘洪浩", "刘浩",
            "刘涛", "刘炎鑫", "刘煜", "刘照全", "刘燕霞", "刘爱国", "刘玉娟", "刘玉康", "刘玉柱", "刘玉翠",
            "刘瑞瑞", "刘甲东", "刘磊", "刘秀芝", "刘立业", "刘红莲", "刘纯阳", "刘统锡", "刘美玲", "刘艳",
            "刘艳丽", "刘艳鹏", "刘芳宇", "刘芹芹", "刘荣", "刘莉", "刘莉娟", "刘蓉", "刘蕊", "刘虎", "刘超",
            "刘金忠", "刘银华", "刘锋", "刘锦龙", "刘青春", "刘静", "刘静波", "刘韶杰", "刘鹏", "劳业威",
            "华影", "单长亮", "南庆磊", "卞士娜", "占东辉", "卢军", "卢凡朝", "卢壮", "卢宗刚", "卢宗钢",
            "卢廷洪", "卢汉学", "卢添龙", "卢茂权", "古强", "史发根", "史岩", "史浩群", "叶兵兵", "叶剑英",
            "叶大金", "叶子帆", "司海全", "向延权", "吕修梅", "吕凤良", "吕华奇", "吕发会", "吕国泽", "吕本新",
            "吕琳", "吕袅佳", "吴一文", "吴乐忧", "吴云鹏", "吴伟亮", "吴利伟", "吴士玉", "吴宏宇", "吴巡",
            "吴庄", "吴建树", "吴志成", "吴才明", "吴文英", "吴文静", "吴明", "吴晓华", "吴晓峰", "吴晓明",
            "吴晓波", "吴朋", "吴松", "吴波"

    };

    public ChineseNameGenerator() {
        super(new RandomSequenceArrayGenerator<>(names));
    }

    @Override
    public String generate() {
        return generator.generate();
    }
}
